# KMeans for Mall Customers Segmentation

*   <b>CustomerID</b>: random ID assigned to each customer
*   <b>Gender</b>: Male or Female
*   <b>Age</b>: Age of customer
*   <b>Annual Income (k$)</b>: Income in thousands of dollars
*   <b>Spending Score (1-100)</b>: Rating of customer spending at mall

### Import Data and Libraries

In [1]:
import pandas as pd
import numpy as np

from sklearn.cluster import KMeans

import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px

%matplotlib inline

In [2]:
customersDf = pd.read_csv('./mall_customers.csv')
customersDf.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

### EDA

1.   Remove irrelevant features
2.   Use the .info() method to check missing values, data types, etc.
3.   Use the .describe() to produce summary of descriptive statistics for the dataset

In [3]:
irrelevantFeautures = ['CustomerID']
customersDf.drop( irrelevantFeautures, axis=1, inplace=True )
customersDf.head()

   Gender  Age  Annual Income (k$)  Spending Score (1-100)
0    Male   19                  15                      39
1    Male   21                  15                      81
2  Female   20                  16                       6
3  Female   23                  16                      77
4  Female   31                  17                      40

In [4]:
customersDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Gender                  200 non-null    object
 1   Age                     200 non-null    int64
 2   Annual Income (k$)      200 non-null    int64
 3   Spending Score (1-100)  200 non-null    int64
dtypes: int64(3), object(1)
memory usage: 6.4+ KB

In [5]:
customersDf.describe()

              Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000          200.000000              200.000000
mean    38.850000           60.560000               50.200000
std     13.969007           26.264721               25.823522
min     18.000000           15.000000                1.000000
25%     28.750000           41.500000               34.750000
50%     36.000000           61.500000               50.000000
75%     49.000000           78.000000               73.000000
max     70.000000          137.000000               99.000000